<template>
  <div style="display: flex;justify-content: center;align-items: center;">
    <div>
      <diff-button>默认按钮</diff-button>
      <diff-button icon="setting">默认按钮</diff-button>
      <diff-button loading>默认按钮</diff-button>
      <diff-button disabled>默认按钮</diff-button>
    </div>

<!--    <div style="width:600px;border:1px solid black;">-->
<!--      <p>段落1</p>-->
<!--      <p>段落2</p>-->
<!--      <p>段落3</p>-->
<!--      <p>段落4</p>-->
<!--      <p>段落5</p>-->
<!--      <p>段落6</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落8</p>-->
<!--      <p>段落9</p>-->
<!--      <diff-sticky :distance="100">-->
<!--        <div style="border:1px solid red;">-->
<!--          <div>我是一个粘滞的div</div>-->
<!--        </div>-->
<!--      </diff-sticky>-->
<!--      <p>段落1</p>-->
<!--      <p>段落2</p>-->
<!--      <p>段落3</p>-->
<!--      <p>段落4</p>-->
<!--      <p>段落5</p>-->
<!--      <p>段落6</p>-->
<!--      <p>段落7</p>-->
<!--      <p>段落8</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--      <p>段落9</p>-->
<!--    </div>-->
<!--    -->
  </div>
</template>

<script>
  import DiffSticky from './sticky/sticky'
  import DiffButton from './button/button'

  export default {
    name: 'demo',
    components: {
      DiffSticky,DiffButton
    },
    data() {
      return {}
    },
    methods: {},
    mounted() {
    }

  }
</script>

<style>
  * { margin: 0;padding: 0;box-sizing: border-box; }
  body {background: #fff;}
  img { max-width: 100%; }
</style>

<style scoped lang="scss"></style>
